
/* Напишите функцию power, реализующую возведение целого числа в неотрицательную целую степень. Функция power должна принимать на вход два целых числа и возвращать целое число. 
При выполнении задания учтите, что функция обязательно должна называться power, функция ничего не должна читать со входа или выводить. 

Требования к реализации: в этом задании вам нужно реализовать только функцию power. Вы можете определять вспомогательные функции, если они вам нужны. Реализовывать функции main не нужно.*/

#include <iostream>

using namespace std;



int power(int x, unsigned p)
{
	int answer;
	if (p == 0)
	{
		answer = 1;
	}
	else
	{
		answer = x;
		unsigned i = 1;
		while (i <= p)
		{
			answer = answer*x;
			i = i + 1;
		}
	}
	return answer;
}

